let handler = m => m;

handler.all = async function (m) {
  let chat = global.db.data.chats[m.chat];
  let responses;
  if (/^يونا احبيك|يونا أحبيك|يونا بدي اتزوجك|يونا انتي الي|يونا اموت فيك$/i.test(m.text)) {
    responses = [
      'شكرا  ', 
      'بفكر في الأمر', 
            'و انا', 
                  'خجلتني', 
                        'خلاص لا تخجلني ', 
                              'اسكتتتتت ترا اضربك عيب وش هل كلام   ', 
                                    'طيب و بعدين ' 
    ];
  } else if (/^مرحبا|السلام عليكم|سلام عليكم$/i.test(m.text)) {
    responses = [
      'وعليكم السلام', 
         'وعليكم السلام حبي متور.', 
             ' وعليكم السلام كيفك', 
                  'وعليكم السلام ورحمة الله وبركاته'
    ];
  }else if (/^يونا كيفيك|كيفك|كيفيك|كيف الأحوال|كيف حالكم$/i.test(m.text)) {
    responses = [
      'كل شيء بخير الحمد لله ', 
         ' مدري  ', 
             ' الحمد لله ماشي الحال ', 
                 'الحمد الله', 
                     ' اذا انت بخير انا بخير'
    ];
  }else if (/^كل زق|كلزق|كزق|زق$/i.test(m.text)) {
    responses = [
      'عيب ', 
         ' تأدب ', 
             ' يا وسخ ', 
                 'الله يهديك ', 
                  ' عيب يا طفل'
    ];
}else if (/^ماذا تفعل|ايش تسوي|وش تسوي|ايش قاعد تسوي$/i.test(m.text)) {
    responses = [
      'ولا شيء و انت  ', 
          'اشرب شاي تفضل  ', 
               'اتفرج تلفاز  ', 
                 'أشاهد انمي ', 
                  'اكلمك '
    ];
  }else if (/^هههه|ههههه|هههههه|ههههههه|هههههههه|ههههههههه|هههههههههه$/i.test(m.text)) {
    responses = [
      'دوم هل ضحكة ', 
           ' دايمه', 
                  'دوم يا رب  ', 
                        'ههه ', 
                        'ههههههههه', 
                        'ايش لي يضحك', 
                        'اضحك معاك؟', 
                            'دوم '
    ];
  }else if (/^صباح الخير|صباح النور|صباح الورد$/i.test(m.text)) {
    responses = [
      ' صباح الفل ', 
         '  صباح المدرسة', 
             ' صباح ولا مساء ', 
                 '  انا بنام تصبح على خير ', 
                  ' روح كمل نوم'
    ];
  }else if (/^يونا اسكتي|اسكتي شوي|يا بنتي اسكتي$/i.test(m.text)) {
    responses = [
            'ما دخلك ', 
              ' مش علي كيفك', 
                'لا يا مين انت لاتسكتني', 
                  'اسكت انت'
    ];
   } else if (/^يونا|يوي|يوناع$/i.test(m.text)) {
    responses = [
      'ايش؟ ', 
         'شو بدك؟  ', 
             'مش وقتك  ', 
                 ' ها؟ ', 
                  'ايش فيه؟ '
    ];
  }else if (/^تصبح على خير|تصبح ع خير|تصبحو على خير|بنام|يلا بنام انا|تصبحي على خير$/i.test(m.text)) {
    responses = [
    'تصبح على خير  ', 
     ' و انت بخير  ', 
      'وانت من اهل الخير والسعادة والعافية والسرور وعطر الزهور تفوح بعطرك الجميل والرائع يا شيخ.  ', 
       '  تشوف خير', 
        ' و انت من اهله ', 
     
    ];
  }
  if (responses) {
    let randomIndex = Math.floor(Math.random() * responses.length);
    conn.reply(m.chat, responses[randomIndex], m);
  }
  return !0
};

export default handler;
